[
  {
    "project_name": "Dogs",
    "project_description": "Este projeto consiste em uma rede social inspirada no Instagram, feita especialmente para cachorros. Consome uma API e retorna os dados. Podemos efetuar login, registrar como novo usuário, postar uma nova foto, apagar fotos, recuperar senhas, etc. tudo através de uma API. Desenvolvida com React.js.",
    "project_url": "https://dogsreact.netlify.app",
    "project_git": "https://github.com/CaioAugustoo/dogs",
    "project_image": "https://i.gyazo.com/69b06e4c38c3e07eb066ac6f0906b1b1.jpg"
  },
  {
    "project_name": "PickPallet",
    "project_description": "Este projeto é um clone de ColorHunt. Ambas web app's possuem as mesmas intenções: reunir diversas paletas afim de ajudar designers e artistas. Qualquer usuário pode visualizar/criar qualquer paleta e copiar cada cor de cada paleta. Além do mais, contém um scroll infinito. É consumida uma API na qual eu desenvolvi. Realizado com React.js.",
    "project_url": "https://pickpallet.netlify.app",
    "project_git": "https://github.com/CaioAugustoo/pick_pallet",
    "project_image": "https://i.gyazo.com/f5d963e93d930ed900ffe580b5849b09.png"
  },
  {
    "project_name": "Blog",
    "project_description": "Este projeto consiste em um blog pessoal, onde futuramente farei posts dando dicas e passando conhecimentos que eu adquiri e que irei adquirindo ao longo de minha carreira. Neste projeto eu aprendi a como utilizar novas bibliotecas e pude experimentar o Next.js. Foi meu primeiro projeto com Next.js. Foi utilizado o TypeScript para tipagens.",
    "project_url": "https://caio-blog.netlify.app",
    "project_git": "https://github.com/CaioAugustoo/blog_nextjs",
    "project_image": "https://i.gyazo.com/ee49d8c9c89f4875c5679a58ba2f2f75.png"
  },
  {
    "project_name": "CV19Tracker",
    "project_description": "Este foi meu primeiro projeto realizado com React.js. Este projeto consome uma API Brasileira que retorna os dados em tempo real da situação do coronavírus no Brasil e no mundo. Pude aprender bastante com este projeto. Aprendi a como consumir API's dentro do React e a como utilizar componentes funcionais.",
    "project_url": "https://cv19tracker.netlify.app",
    "project_git": "https://github.com/CaioAugustoo/cv19tracker",
    "project_image": "https://i.gyazo.com/ad7a6db28ac6352ace7f1c99cdc52622.png"
  },
  {
    "project_name": "Gitfinder",
    "project_description": "Este projeto consiste em consumir a API do Github. Você digita um usuário do Github e a aplicação irá retornar dados do perfil procurado. É retornado dados como: Foto de perfil do usuário, nome, etc. É filtrado, também, os repositórios com mais estrelas. Feito com React.js.",
    "project_url": "https://git-overview.netlify.app",
    "project_git": "https://github.com/CaioAugustoo/git_finder",
    "project_image": "https://i.gyazo.com/8be64821c462661185745e7d8db60166.png"
  }
]
